W8D1/Reddit on Rails/reddit_on_rails/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "hello"], ["url", ""], ["content", ""], ["sub_id", 1], ["author_id", 1], ["created_at", "2020-09-14 22:20:07.891282"], ["updated_at", "2020-09-14 22:20:07.891282"]]
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "hellohello"], ["updated_at", "2020-09-14 23:31:28.426668"], ["id", 1]]
---
    def update
        @post = Post.find_by(id: params[:id])
        # if @post
            if @post.author_id == current_user.id
                if @post.update(post_params)