W8D1/Reddit on Rails/reddit_on_rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "jon"], ["description", "the great"], ["moderator", 2], ["created_at", "2020-09-14 22:21:27.591898"], ["updated_at", "2020-09-14 22:21:27.591898"]]
---
    def create
        @sub = Sub.new(sub_params)
        if @sub.save